class Program
{
    /*Створити ступінчастий масив з 4-х рядків. У першому рядку – 10
    елементів, у другому 12, у третьому – 5, у четвертому – 8. Заповнити
    масив цілими числами у коді. Вивести елементи масиву на консоль.
    Обчислити загальну суму елементів масиву.*/

    private static void Main(string[] args)
    {
        int[][] m = new int[4][];
        m[0] = new int[10] {1,2,3,4,5,6,7,8,9,10};
        m[1] = new int[12] {11,12,13,14,15,16,17,18,19,20,21,22};
        m[2] = new int[5] {1,1,1,1,1};
        m[3] = new int[8] {2,3,4,44,3,5,66,2};
        int sum = 0;

        for(int i = 0; i < m.Length; i++)
        {
            for(int j = 0; j < m[i].Length; j++)
            {
                Console.Write($"{m[i][j]}\t");
                sum += m[i][j];
            }
            Console.WriteLine("");
        }
        Console.WriteLine($"Сумма: {sum}");
    }
}